/*------------------------------------------------------------------------------
                                    定义IO口
------------------------------------------------------------------------------*/

#define LED_1 P1_1

/*------------------------------------------------------------------------------
                                    枚举类型
------------------------------------------------------------------------------*/
//                     16M         32M
enum SYSCLK_SRC     {RC_16MHz, XOSC_32MHz};     //选择晶振源

//                   开   关    反转
enum LED_STATE      {ON, OFF, REVERSE};         //led状态



/*------------------------------------------------------------------------------
                                    函数声明
------------------------------------------------------------------------------*/

// 初始化IO口
extern void initIo();

// 初始化所有设备
extern void init();

// 选择系统时钟源(主时钟源)
extern void systemClockSourceSelect(enum SYSCLK_SRC source);

// 设置led
extern void setLed(enum LED_STATE state);